using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ISIP324_Kovalenko
{
    internal class Program
    {
        class Person { }
        class Student : Person { }
        class Teacher : Person { }
        static void Main(string[] args)
        {
//            Для выполнения задания используйте все возможности языка C#, изученные ранее (классы, списки, перечисления, LINQ и так далее).Обязательно сделайте проверку всевозможных вводимых значений (не должно быть возможности создать пустой товар, с отрицательной ценой, с отрицательным количеством и тому подобное).Программа не должна вылетать в процессе работы.Программа должна выводить информацию в чётком и ясном виде для пользователя.Не забудьте отправлять код по частям, разными коммитами, и делать осмысленные комментарии к коммитам.

//Вам необходимо создать систему управления университетом. Система должна позволять управлять информацией о студентах, преподавателях и курсах через консоль.

//В университете есть студенты, которые могут записываться на различные курсы.У каждого курса есть преподаватель, который его ведет. Система должна хранить информацию обо всех участниках учебного процесса и позволять выполнять различные операции с ними.

//Пользователь должен иметь возможность добавлять в систему новых студентов и просматривать информацию о них. Также необходимо реализовать функциональность записи студентов на курсы и просмотра списка всех курсов, на которые записан конкретный студент.

//Система должна позволять добавлять преподавателей и просматривать информацию о каждом из них. Преподаватели могут быть назначены на различные курсы, которые они будут вести.

//Для управления курсами нужно реализовать возможность создания новых курсов, просмотра детальной информации о каждом курсе и вывода списка всех студентов, записанных на конкретный курс.

//Дополнительно программа должна предоставлять возможность вывода полных списков: всех студентов в системе, всех преподавателей и всех доступных курсов.

//Ваша задача -спроектировать архитектуру приложения, используя принципы ООП, и реализовать консольное меню для удобного взаимодействия со всеми описанными функциями системы.

//Требования к проектированию

//При разработке системы вы обязаны применить принципы ООП:

//            1.Абстракция

//Выделите общие характеристики и поведение для похожих сущностей.

//2.Наследование

//Студенты и преподаватели имеют общие характеристики(имя, возраст, контактная информация и т.д.). Используйте наследование, чтобы избежать дублирования кода.

//3.Инкапсуляция

//Данные объектов должны быть защищены от прямого доступа. Подумайте, какие поля должны быть приватными, какие методы публичными.

//4.Полиморфизм

//Разные типы людей в университете могут иметь разное представление своей информации.Реализуйте возможность работы с объектами через базовый класс.



        }
    }
}
